import {Task} from '@/models'

import Task05 from '@/tasks/Task05'
import Task06 from '@/tasks/Task06'
import Task08 from '@/tasks/Task08'
import Task09 from '@/tasks/Task09'

// const modules = import.meta.glob('../tasks/*/index.jsx', {
//   import: 'default',
//   eager: true,
// })

export const TASKS = [
  new Task({
    title: 'Задача №5',
    description:
      'Дано список спортсменів. Потрібно сформувати список тих, які будуть брати участь у змаганні. При цьому є два стовпці. В одному відображені всі спортсмени, в іншому – список тих, хто був вибраний. При натисканні на зелену стрілку спортсмен переміщається у список для змагань. При натисканні на червону стрілку спортсмен переміщається у загальний список.',
    component: Task05,
    // component: modules['../tasks/Task05/index.jsx'],
  }),
  new Task({
    title: 'Задача №6',
    description:
      'Пари для танців. Поступово вибираємо хлопця, дівчину і додаємо у обрані пари. Пару можна видалити. Поки не вибрано хлопця і дівчину кнопка «Додати» заблокована.  Якщо не вистачає хлопців або дівчат вибір також блокується..',
    component: Task06,
  }),
  new Task({
    title: 'Задача №8',
    description:
      'Дано список автомобілів (марка, рік випуску, ціна). Сформувати елементи для фільтрування з використанням випадаючого списку (контент цих випадаючих списків сформувати у залежності від переданого списку).',
    component: Task08,
  }),
  new Task({
    title: 'Задача №9',
    description:
      'Перекладач. Користувачу виводять змішані картки з словами на англійській і українській мові. Користувач поступово клікає на картки (виділяємо синьою рамкою). Якщо знайдено правильні пари карток, що відповідають одному слову, то видаляємо ці картки. Інакше - виділяємо червоною рамкою і через секунду забираємо рамку.',
    component: Task09,
  }),
]
