import {Container, Typography} from '@/components/ui'

function TypographyPage() {
  return (
    <Container className="space-y-[var(--gutter)] divide-y-1 divide-primary [--gutter:_calc(_var(--spacing)_*_4)] [&>:not(:last-child)]:pb-[var(--gutter)]">
      <div>
        <span className="text-neutral">H1 Alegreya</span>
        <Typography variant="h1">
          Ніхто не може зазнавати безпідставного втручання у його особисте і
          сімейне життя.
        </Typography>
      </div>
      <div>
        <span className="text-neutral">H2 Alegreya</span>
        <Typography variant="h2">
          Ніхто не може зазнавати безпідставного втручання у його особисте і
          сімейне життя.
        </Typography>
      </div>
      <div>
        <span className="text-neutral">H3 Alegreya</span>
        <Typography variant="h3">
          Ніхто не може зазнавати безпідставного втручання у його особисте і
          сімейне життя.
        </Typography>
      </div>
      <div>
        <span className="text-neutral">Body1 Golos Text</span>
        <Typography>
          Ніхто не може зазнавати безпідставного втручання у його особисте і
          сімейне життя, безпідставного посягання на недоторканність його житла,
          таємницю його кореспонденції або на його честь і репутацію. Кожна
          людина має право на захист закону від такого втручання або таких
          посягань. Кожна людина має право на свободу думки, совісті і релігії;
          це право включає свободу змінювати свою релігію або переконання і
          свободу сповідувати свою релігію або переконання як одноособово, так і
          разом з іншими, прилюдним або приватним порядком в ученні,
          богослужінні і виконанні релігійних та ритуальних обрядів.
        </Typography>
      </div>
      <div>
        <span className="text-neutral">Body2 Golos Text</span>
        <Typography variant="body2">
          Ніхто не може зазнавати безпідставного втручання у його особисте і
          сімейне життя, безпідставного посягання на недоторканність його житла,
          таємницю його кореспонденції або на його честь і репутацію. Кожна
          людина має право на захист закону від такого втручання або таких
          посягань. Кожна людина має право на свободу думки, совісті і релігії;
          це право включає свободу змінювати свою релігію або переконання і
          свободу сповідувати свою релігію або переконання як одноособово, так і
          разом з іншими, прилюдним або приватним порядком в ученні,
          богослужінні і виконанні релігійних та ритуальних обрядів.
        </Typography>
      </div>
    </Container>
  )
}

export default TypographyPage
