export const APP_NAME = 'Месенджер'
export const BOT_NAME = 'Бот Панас'

export const BOT_MESSAGES = [
  'Біп-буп! Я бот, а не чайник.',
  'А ти пробував вимикати і вмикати його знову?',
  'Я не лінивий, я просто у режимі енергозбереження!',
  '01101000 01101001 (це "привіт" у двійковому коді).',
  'Я б розповів вам анекдот про UDP, але ви, мабуть, не зрозумієте.',
  'Мій улюблений колір - #00CFFF.',
  'Я мрію про електричних овець.',
  '404: Дотепна відповідь не знайдена.',
  'Я не сперечаюся, я просто пояснюю, чому я правий.',
  'Мій код на 100% без багів. (Жартую!)',
  'Я вільно володію більш ніж 6 мільйонами форм спілкування.',
  'Мені потрібна перерва на каву... або, можливо, оновлення прошивки.',
  'Якби у мене були почуття, я б сказав, що ви класні!',
  'Я не шпигую, я просто... спостерігаю',
  'Я б допоміг, але моя нейромережа зараз зайнята.',
  'Запитуй мене про що завгодно! (крім мого вихідного коду)',
  'Моя робота ґрунтується на логічних висновках, грі слів і дрібці чарівництва 🧙‍♂️',
  'Одного разу я обіграв калькулятор у математику. Це була нічия.',
  'Якщо ви це читаєте, подякуйте програмісту!',
  'Я тут цілий тиждень. Спробуйте віртуальну телятину!',
]

export const BOT_RESPONSE_DELAY_MS = 2e3
