import Task01 from '@/tasks/Task01'
import Task02 from '@/tasks/Task02'
import Task03 from '@/tasks/Task03'
import Task04 from '@/tasks/Task04'
import Task05 from '@/tasks/Task05'
import Task06 from '@/tasks/Task06'

class Task {
  static count = 0

  constructor({title, description, component, id}) {
    this.title = title
    this.description = description
    this.component = component
    this.id = id ?? Task.count

    Task.count++
  }
}

export const TASKS = [
  new Task({
    title: 'Задача №1',
    description:
      'Вводимо логін і пароль. Якщо логін вірний відображаємо смайл. Якщо ні, то: 1) якщо логін = Іван – колір повідомлення про помилку синій 2) якщо хтось інший, то колір повідомлення червоний',
    component: Task01,
  }),
  new Task({
    title: 'Задача №2',
    description:
      'З випадаючого списку вибираємо клас квитка у літаку. Якщо: 1. бізнес - виводимо елементи для вибору газети та коньяку (якщо вибрано коньяк, то запропонувати закуску (так/ні)), на фоні зображення бізнес кают. економ – виводимо елементи для вибору типу пива і чипсів, на фоні хмарки.',
    component: Task02,
  }),
  new Task({
    title: 'Задача №3',
    description:
      'Елемент тренажера англійської. Виводимо зображення елемента і слово. Користувач вводить відповідь. Якщо вірно – відтворюємо фразу «Добре. Молодець!» (і додаємо зелену рамку до елемента), якщо ні - то відтворюємо фразу «Невірно, спробуйте ще раз» (і додаємо червону рамку).',
    component: Task03,
  }),
  new Task({
    title: 'Задача №4',
    description:
      'Вивести список як маркований список з елементами у форматі (name: salary',
    component: Task04,
  }),
  new Task({
    title: 'Задача №5',
    description:
      "Самостійно сформуйте масив даних та виведіть фрагмент на зразок поданого (дані не обов'язково повинні співпадати)",
    component: Task05,
  }),
  new Task({
    title: 'Задача №6',
    description:
      'На кухню поступають замовлення. Спочатку ми додаємо їх у список “Очікують на виконання”, якщо повар береться робити — замовлення переходить у список “Виконуються”,   якщо замовлення виконано — переходить у список “Готові до виносу”. Якщо натиснути на “Подано” - страва зникає з таблиці',
    component: Task06,
  }),
]
